<a href="https://colab.research.google.com/github/2003Himansh/pandas/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
df=pd.read_csv('/content/sample_data/california_housing_train.csv',encoding="latin1")
print(df)
df.head(10)
df.tail(10)
print(f'Shape:{df.shape}')
print(f'Size:{df.size}')
print(f'Columns:{df.columns}')

       longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
0        -114.31     34.19                15.0       5612.0          1283.0
1        -114.47     34.40                19.0       7650.0          1901.0
2        -114.56     33.69                17.0        720.0           174.0
3        -114.57     33.64                14.0       1501.0           337.0
4        -114.57     33.57                20.0       1454.0           326.0
...          ...       ...                 ...          ...             ...
16995    -124.26     40.58                52.0       2217.0           394.0
16996    -124.27     40.69                36.0       2349.0           528.0
16997    -124.30     41.84                17.0       2677.0           531.0
16998    -124.30     41.80                19.0       2672.0           552.0
16999    -124.35     40.54                52.0       1820.0           300.0

       population  households  median_income  median_house_value
0          1015.0       472.0         1.4936             66900.0
1          1129.0       463.0         1.8200             80100.0
2           333.0       117.0         1.6509             85700.0
3           515.0       226.0         3.1917             73400.0
4           624.0       262.0         1.9250             65500.0
...           ...         ...            ...                 ...
16995       907.0       369.0         2.3571            111400.0
16996      1194.0       465.0         2.5179             79000.0
16997      1244.0       456.0         3.0313            103600.0
16998      1298.0       478.0         1.9797             85800.0
16999       806.0       270.0         3.0147             94600.0

[17000 rows x 9 columns]
Shape:(17000, 9)
Size:153000
Columns:Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

# New Section

In [ ]:
import pandas as pd
data= {
    "Name":['ram','shyam','ganshyam'],
    "Age":[22,23,24],
    "City": ['delhi','mumbai','goa']
}
df=pd.DataFrame(data)
print(df)
#save the csv file
#df.to_csv("output.csv",index=False)
#df.to_excel("output.xlsx",index=False)
df.to_json("output.json")
df.head(2)

       Name  Age    City
0       ram   22   delhi
1     shyam   23  mumbai
2  ganshyam   24     goa

    Name  Age    City
0    ram   22   delhi
1  shyam   23  mumbai

In [ ]:
import pandas as pd
df=pd.read_csv('/content/sample_data/california_housing_train.csv',encoding="latin1")
print(df)
print('Displaying the info of data set')
print(df.info())
print('Displaying the shape of data set')
print(df.shape)

       longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
0        -114.31     34.19                15.0       5612.0          1283.0
1        -114.47     34.40                19.0       7650.0          1901.0
2        -114.56     33.69                17.0        720.0           174.0
3        -114.57     33.64                14.0       1501.0           337.0
4        -114.57     33.57                20.0       1454.0           326.0
...          ...       ...                 ...          ...             ...
16995    -124.26     40.58                52.0       2217.0           394.0
16996    -124.27     40.69                36.0       2349.0           528.0
16997    -124.30     41.84                17.0       2677.0           531.0
16998    -124.30     41.80                19.0       2672.0           552.0
16999    -124.35     40.54                52.0       1820.0           300.0

       population  households  median_income  median_house_value
0          1015.0       472.0         1.4936             66900.0
1          1129.0       463.0         1.8200             80100.0
2           333.0       117.0         1.6509             85700.0
3           515.0       226.0         3.1917             73400.0
4           624.0       262.0         1.9250             65500.0
...           ...         ...            ...                 ...
16995       907.0       369.0         2.3571            111400.0
16996      1194.0       465.0         2.5179             79000.0
16997      1244.0       456.0         3.0313            103600.0
16998      1298.0       478.0         1.9797             85800.0
16999       806.0       270.0         3.0147             94600.0

[17000 rows x 9 columns]
Displaying the info of data set
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB
None
Displaying the shape of data set
(17000, 9)

In [ ]:
import pandas as pd
data={
    "name":['ram','shyam','ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,25,26,27,28,16],
    "city":['delhi','mumbai','goa','delhi','mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,40000,50000,60000,70000,80000]

}
df=pd.DataFrame(data)
print("simple dataframe")
print(df)
print("descriptive statistics")
print(df.describe())
print(f'Shape:{df.shape}')
print(f'Size:{df.size}')
print(f'Columns:{df.columns}')

simple dataframe
       name  age    city  salary
0       ram   22   delhi   10000
1     shyam   23  mumbai   20000
2  ganshyam   24     goa   30000
3     sohan   25   delhi   40000
4     mohan   26  mumbai   50000
5       joe   27     goa   60000
6       roy   28   delhi   70000
7     liger   16  mumbai   80000
descriptive statistics
             age        salary
count   8.000000      8.000000
mean   23.875000  45000.000000
std     3.758324  24494.897428
min    16.000000  10000.000000
25%    22.750000  27500.000000
50%    24.500000  45000.000000
75%    26.250000  62500.000000
max    28.000000  80000.000000
Shape:(8, 4)
Size:32
Columns:Index(['name', 'age', 'city', 'salary'], dtype='object')

In [ ]:

import pandas as pd
data={
    "name":['ram','shyam','ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,25,26,27,28,16],
    "city":['delhi','mumbai','goa','delhi','mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,40000,50000,60000,70000,80000]

}
df=pd.DataFrame(data)
print(df)
print("name(single column return series)")
name=df["name"]
print(name)
#multiple column
subset=df[["name","age","city"]]
print(subset)

       name  age    city  salary
0       ram   22   delhi   10000
1     shyam   23  mumbai   20000
2  ganshyam   24     goa   30000
3     sohan   25   delhi   40000
4     mohan   26  mumbai   50000
5       joe   27     goa   60000
6       roy   28   delhi   70000
7     liger   16  mumbai   80000
name(single column return series)
0         ram
1       shyam
2    ganshyam
3       sohan
4       mohan
5         joe
6         roy
7       liger
Name: name, dtype: object
       name  age    city
0       ram   22   delhi
1     shyam   23  mumbai
2  ganshyam   24     goa
3     sohan   25   delhi
4     mohan   26  mumbai
5       joe   27     goa
6       roy   28   delhi
7     liger   16  mumbai

In [ ]:
import pandas as pd
data={
    "name":['ram','shyam','ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,25,26,27,28,16],
    "city":['delhi','mumbai','goa','delhi','mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,40000,50000,60000,70000,80000]

}
df=pd.DataFrame(data)
print("salary is greater than 50000")
high_salary=df[df["salary"]>50000]
print(high_salary)
#filtered salary and age
print("salary is greater than 50000 and age is >21")
filtered_data=df[(df["salary"]>50000) & (df["age"]>21)]
print(filtered_data)
# filtered salary or age
print("salary is greater than 50000 or age is >21")
filtered_data=df[(df["salary"]>50000) | (df["age"]>21)]
print(filtered_data)

salary is greater than 50000
    name  age    city  salary
5    joe   27     goa   60000
6    roy   28   delhi   70000
7  liger   16  mumbai   80000
salary is greater than 50000 and age is >21
  name  age   city  salary
5  joe   27    goa   60000
6  roy   28  delhi   70000
salary is greater than 50000 or age is >21
       name  age    city  salary
0       ram   22   delhi   10000
1     shyam   23  mumbai   20000
2  ganshyam   24     goa   30000
3     sohan   25   delhi   40000
4     mohan   26  mumbai   50000
5       joe   27     goa   60000
6       roy   28   delhi   70000
7     liger   16  mumbai   80000

In [ ]:
import pandas as pd
data={
    "name":['ram','shyam','ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,25,26,27,28,16],
    "city":['delhi','mumbai','goa','delhi','mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,40000,50000,60000,70000,80000]

}
df=pd.DataFrame(data)
#insert new column
df["department"]=['Hr','Finace','It','Hr','data science','finance','It','It']
df["bonus"]=df["salary"]*0.1

#using insert(loc,'column name',[data])
df.insert(0,"id",[1,2,3,4,5,6,7,8])
print(df)

   id      name  age    city  salary    department   bonus
0   1       ram   22   delhi   10000            Hr  1000.0
1   2     shyam   23  mumbai   20000        Finace  2000.0
2   3  ganshyam   24     goa   30000            It  3000.0
3   4     sohan   25   delhi   40000            Hr  4000.0
4   5     mohan   26  mumbai   50000  data science  5000.0
5   6       joe   27     goa   60000       finance  6000.0
6   7       roy   28   delhi   70000            It  7000.0
7   8     liger   16  mumbai   80000            It  8000.0

In [ ]:
import pandas as pd
data={
    "name":['ram','shyam','ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,25,26,27,28,16],
    "city":['delhi','mumbai','goa','delhi','mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,40000,50000,60000,70000,80000]

}
df=pd.DataFrame(data)
#update the data[loc,'column_name']=data(new)
df.loc[0,'salary']=20000
df.loc[3,'age']=29
#print(df)
#update multiple data
df.loc[1:3,'city']='pune'
#df['salary']=df['salary']*1.05

#print(df)
#removing column(columns=[column_name],inplace=True)
df.drop(columns=['age','city'],inplace=True)
print(df)

       name  salary
0       ram   20000
1     shyam   20000
2  ganshyam   30000
3     sohan   40000
4     mohan   50000
5       joe   60000
6       roy   70000
7     liger   80000

In [ ]:
#handling missing data
import pandas as pd
data={
    "name":['ram',None,'ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,None,26,27,28,16],
    "city":['delhi','mumbai','goa',None,'mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,None,50000,60000,70000,80000]

}
df=pd.DataFrame(data)

#print(df.isnull().sum())
#df.dropna(axis=0,inplace=True)
df["age"].fillna(df["age"].mean(),inplace=True)
df["salary"].fillna(df["salary"].mean(),inplace=True)
print(df)

       name        age    city        salary
0       ram  22.000000   delhi  10000.000000
1      None  23.000000  mumbai  20000.000000
2  ganshyam  24.000000     goa  30000.000000
3     sohan  23.714286    None  45714.285714
4     mohan  26.000000  mumbai  50000.000000
5       joe  27.000000     goa  60000.000000
6       roy  28.000000   delhi  70000.000000
7     liger  16.000000  mumbai  80000.000000

/tmp/ipython-input-1154847848.py:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["age"].fillna(df["age"].mean(),inplace=True)
/tmp/ipython-input-1154847848.py:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["salary"].fillna(df["salary"].mean(),inplace=True)

In [ ]:
import pandas as pd
data={
    "name":['ram','shyam','ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,None,26,27,28,16],
    "city":['delhi','mumbai','goa','delhi','mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,40000,50000,60000,70000,80000]

}
df=pd.DataFrame(data)
#df.interpolate(method='linear',axis=0,inplace=True)
#df.interpolate(method='polynomial', order=2, axis=0, inplace=True)
df.interpolate(method='spline', order=2, axis=0, inplace=True)
print(df)

/tmp/ipython-input-1575846025.py:12: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method='spline', order=2, axis=0, inplace=True)

       name       age    city  salary
0       ram  22.00000   delhi   10000
1     shyam  23.00000  mumbai   20000
2  ganshyam  24.00000     goa   30000
3     sohan  24.98719   delhi   40000
4     mohan  26.00000  mumbai   50000
5       joe  27.00000     goa   60000
6       roy  28.00000   delhi   70000
7     liger  16.00000  mumbai   80000

In [ ]:
import pandas as pd
data={
    "name":['ram','shyam','ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,43,26,20,28,16],
    "city":['delhi','mumbai','goa','delhi','mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,40000,50000,60000,70000,80000]

}
df=pd.DataFrame(data)
#ascending false (decending) and ascending True(ascending)
df.sort_values(by='age',ascending=True,inplace=True)
print(df)

       name  age    city  salary
7     liger   16  mumbai   80000
5       joe   20     goa   60000
0       ram   22   delhi   10000
1     shyam   23  mumbai   20000
2  ganshyam   24     goa   30000
4     mohan   26  mumbai   50000
6       roy   28   delhi   70000
3     sohan   43   delhi   40000

In [ ]:
#aggregation method mean(),max(),min(),count(),sum()
import pandas as pd
data={
    "name":['ram','shyam','ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,25,26,27,28,16],
    "city":['delhi','mumbai','goa','delhi','mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,40000,50000,60000,70000,80000]

}
df=pd.DataFrame(data)
avg_salary=df['salary'].mean()
print(avg_salary)
max_salary=df['salary'].max()
print(max_salary)
min_salary=df['salary'].min()
print(min_salary)
sum_salary=df['salary'].sum()
print(sum_salary)
count_salary=df['salary'].count()
print(count_salary)

45000.0
80000
10000
360000
8

In [ ]:
import pandas as pd
data={
    "name":['ram','shyam','ganshyam','sohan','mohan','joe','roy','liger'],
    "age":[22,23,24,25,26,27,28,16],
    "city":['delhi','mumbai','goa','delhi','mumbai','goa','delhi','mumbai'],
    "salary":[10000,20000,30000,40000,50000,60000,70000,80000]

}
df=pd.DataFrame(data)
grouped=df.groupby('salary')
print(grouped.sum())

            name  age    city
salary
10000        ram   22   delhi
20000      shyam   23  mumbai
30000   ganshyam   24     goa
40000      sohan   25   delhi
50000      mohan   26  mumbai
60000        joe   27     goa
70000        roy   28   delhi
80000      liger   16  mumbai

In [ ]:
import pandas as pd

df_customers = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4, 5],
    'Name': ['ram', 'shyam', 'ganshyam', 'sohan', 'mohan']
})

df_orders = pd.DataFrame({
    'CustomerID': [1, 2, 3, 7, 8],
    'OrderAmount': [250, 350, 450, 750, 950]
})

df_merged = pd.merge(df_customers, df_orders, on='CustomerID', how='inner')

print('inner join')
print(df_merged)

inner join
   CustomerID      Name  OrderAmount
0           1       ram          250
1           2     shyam          350
2           3  ganshyam          450

In [ ]:
#concatenation
import pandas as pd
df_region1=pd.DataFrame ({
    'CustomerID':[1,2,3,4,5],
    'Name':['ram','shyam','ganshyam','joy','roy']
})
df_region2=pd.DataFrame({
    'CustomerID':[6,7,8,9,10],
    'Name':['liger','joe','mohan','sohan','roe']

})
concatenated_df=pd.concat([df_region1,df_region2],axis=0,ignore_index=True)
print(concatenated_df)

   CustomerID      Name
0           1       ram
1           2     shyam
2           3  ganshyam
3           4       joy
4           5       roy
5           6     liger
6           7       joe
7           8     mohan
8           9     sohan
9          10       roe